In [1]:
pip install pandas

SyntaxError: invalid syntax (<ipython-input-1-376be87a97f7>, line 1)

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\user\appdata\roaming\python\python38\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [4]:
df=pd.DataFrames({"names":["cat","apple","dog","carrot"]}
                  {"categories":["animal","fruit","animal","vegetable"]})

SyntaxError: invalid syntax (<ipython-input-4-4891f7b93ec4>, line 2)

In [5]:
df

NameError: name 'df' is not defined

In [6]:
df=pd.DataFrames({"names":["cat","apple","dog","carrot"],
                  "categories":["animal","fruit","animal","vegetable"]})
df

AttributeError: module 'pandas' has no attribute 'DataFrames'

In [7]:
import DataFrames as df

ModuleNotFoundError: No module named 'DataFrames'

In [8]:
import DataFrame as df

ModuleNotFoundError: No module named 'DataFrame'

In [9]:
df=pd.DataFrame({"names":["cat","apple","dog","carrot"],
                  "categories":["animal","fruit","animal","vegetable"]})
df

    names categories
0     cat     animal
1   apple      fruit
2     dog     animal
3  carrot  vegetable

In [10]:
df.head()

    names categories
0     cat     animal
1   apple      fruit
2     dog     animal
3  carrot  vegetable

In [11]:
df.info

<bound method DataFrame.info of     names categories
0     cat     animal
1   apple      fruit
2     dog     animal
3  carrot  vegetable>

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   names       4 non-null      object
 1   categories  4 non-null      object
dtypes: object(2)
memory usage: 96.0+ bytes

In [13]:
df.describe()

       names categories
count      4          4
unique     4          3
top      cat     animal
freq       1          2

In [14]:
df.loc[1]

names         apple
categories    fruit
Name: 1, dtype: object

In [15]:
df

    names categories
0     cat     animal
1   apple      fruit
2     dog     animal
3  carrot  vegetable

In [17]:
df.loc[0][1]

'animal'

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.columns

Index(['names', 'categories'], dtype='object')

In [21]:
df.to_numpy()

array([['cat', 'animal'],
       ['apple', 'fruit'],
       ['dog', 'animal'],
       ['carrot', 'vegetable']], dtype=object)

In [22]:
df

    names categories
0     cat     animal
1   apple      fruit
2     dog     animal
3  carrot  vegetable

In [23]:
df.T

                 0      1       2          3
names          cat  apple     dog     carrot
categories  animal  fruit  animal  vegetable

In [24]:
df[0:2]

   names categories
0    cat     animal
1  apple      fruit

In [25]:
df[:3]

   names categories
0    cat     animal
1  apple      fruit
2    dog     animal

In [26]:
df2=df.copy()

In [27]:
df2

    names categories
0     cat     animal
1   apple      fruit
2     dog     animal
3  carrot  vegetable

In [28]:
df.sort_values(by="names")

    names categories
1   apple      fruit
3  carrot  vegetable
0     cat     animal
2     dog     animal

In [29]:
df.sort_values(by="categories")

    names categories
0     cat     animal
2     dog     animal
1   apple      fruit
3  carrot  vegetable